docs/posts/2025-01-07-creating-rss-feed.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating an RSS Feed</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Creating an RSS Feed
<br />
<span class="subtitle">Jan 07, 2025 00:00</span>
</h1>
<p>
I struggled with ox-rss for my blog feed and really could never get it working. It would generate an RSS file, but for some reason, the feed readers wouldn&rsquo;t get anything. I don&rsquo;t know enough about XML to fix it, and I had neither the time right now nor the inclination to learn.
</p>

<p>
So, I stumbled across <a href="https://github.com/emacsmirror/webfeeder">Emacs Webfeeder</a>, which creates a feed from the HTML files. After adding it with use-package, I removed the RSS component of my <code>publish.el</code> file, and changed by blog build function to this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">orgblog-build</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">progn</span>
    (find-file <span class="org-string">"~/sites/orgblog/publish.el"</span>)
    (eval-buffer)
    (org-publish-all)
    (webfeeder-build <span class="org-string">"atom.xml"</span>
                           <span class="org-string">"./docs"</span>
                           <span class="org-string">"https://randyridenour.net/"</span>
                           (<span class="org-keyword">let</span> ((default-directory (expand-file-name <span class="org-string">"./docs"</span>)))
                               (remove <span class="org-string">"posts/index.html"</span>
                                         (directory-files-recursively <span class="org-string">"posts"</span>
                                                                            <span class="org-string">".*\\.html$"</span>)))
                           <span class="org-builtin">:title</span> <span class="org-string">"Randy Ridenour"</span>
                           <span class="org-builtin">:description</span> <span class="org-string">"Blog posts by Randy Ridenour"</span>)
    (kill-buffer))
  (message <span class="org-string">"Build complete!"</span>))
</pre>
</div>


<p>
After building the site, Webfeeder generated an <code>atom.rss</code> file, and everything works fine. That was the last critical component of my endeavor to blog with Emacs only.
</p>

<div class="tagline" id="orgab5ab63">
<p>
Tagged:  <a href="../tags/blog.html">Blog</a> <a href="../tags/emacs.html">Emacs</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
